app/controllers/inventory_items_controller.rb

  def index
    # we implement limit and offset
    if params['offset'] && params['limit']
      @items = InventoryItem.all(:offset => params['offset'].to_i, :limit => params['limit'].to_i)
---
SELECT "inventory_items".* FROM "inventory_items"

  def show
    @item = InventoryItem.find(params[:id])
---
SELECT "inventory_items".* FROM "inventory_items" WHERE "inventory_items"."id" = $1 LIMIT 1  [["id", "2"]]

  def edit
    @item = InventoryItem.find(params[:id])
---
SELECT "inventory_items".* FROM "inventory_items" WHERE "inventory_items"."id" = $1 LIMIT 1  [["id", "2"]]

  def create
    uploaded_io = params[:inventory_item][:photoUri]
    File.open(Rails.root.join('public', 'uploads', uploaded_io.original_filename), 'wb') do |file|
      file.write(uploaded_io.read)
      extension = File.extname(uploaded_io.original_filenam)
      key = "#{SecureRandom.uuid}#{extension}"
      obj = @s3bucket.object(key)
      obj.upload_file(Rails.root.join('public', 'uploads', uploaded_io.original_filename), {:acl => 'public-read'})
      params[:inventory_item][:photoUri] = object.public_url.gsub("https://", "http://")
    end

    uploaded_io = params[:inventory_item][:signatureUri]
    File.open(Rails.root.join('public', 'uploads', uploaded_io.original_filename), 'wb') do |file|
      file.write(uploaded_io.read)
      extension = File.extname(uploaded_io.original_filenam)
      key = "#{SecureRandom.uuid}#{extension}"
      obj = @s3bucket.object(key)
      obj.upload_file(Rails.root.join('public', 'uploads', uploaded_io.original_filename))
      params[:inventory_item][:signatureUri] = obj.public_url
    end
    @item = InventoryItem.new(params[:inventory_item])
    respond_to do |format|
      if @item.save
---
INSERT INTO "inventory_items" ("upc", "productName", "quantity", "employeeId", "photoUri", "signatureUri", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    @item = InventoryItem.find(params[:id])

    uploaded_io = params[:inventory_item][:photoUri]
    File.open(Rails.root.join('public', 'uploads', uploaded_io.original_filename), 'wb') do |file|
      file.write(uploaded_io.read)
      extension = File.extname(uploaded_io.original_filenam)
      key = "#{SecureRandom.uuid}#{extension}"
      obj = @s3bucket.object(key)
      obj.upload_file(Rails.root.join('public', 'uploads', uploaded_io.original_filename), {:acl => 'public-read'})
      params[:inventory_item][:photoUri] = object.public_url.gsub("https://", "http://")
    end

    uploaded_io = params[:inventory_item][:signatureUri]
    File.open(Rails.root.join('public', 'uploads', uploaded_io.original_filename), 'wb') do |file|
      file.write(uploaded_io.read)
      extension = File.extname(uploaded_io.original_filenam)
      key = "#{SecureRandom.uuid}#{extension}"
      obj = @s3bucket.object(key)
      obj.upload_file(Rails.root.join('public', 'uploads', uploaded_io.original_filename))
      params[:inventory_item][:signatureUri] = obj.public_url
    end


    respond_to do |format|
      if @item.update_attributes(params[:inventory_item])
---
SELECT "inventory_items".* FROM "inventory_items" WHERE "inventory_items"."id" = $1 LIMIT 1  [["id", "2"]]
UPDATE "inventory_items" SET "photoUri" = 'http://inventory-demo.s3-us-west-2.amazonaws.com/2f438a50-1738-4611-88d3-da06e2f31ae7.jpg', "signatureUri" = 'http://inventory-demo.s3-us-west-2.amazonaws.com/4307973a-5299-4319-84fe-e9da8a51ecf7.png', "updated_at" = '2017-03-14 15:12:49.999604' WHERE "inventory_items"."id" = 2

  def destroy
    @item = InventoryItem.find(params[:id])
    @item.destroy
---
SELECT "inventory_items".* FROM "inventory_items" WHERE "inventory_items"."id" = $1 LIMIT 1  [["id", "6"]]
DELETE FROM "inventory_items" WHERE "inventory_items"."id" = $1  [["id", 6]]